src/Reports/ГрафикиРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ГрафикиРаботы</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбщийОтчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПериода</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавокЗавершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделениеЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизацииЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолжностьЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботыЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостоянияЗавершения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрядЕТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышенныйКоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИтоговоеПовышениеПоИнструкции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Временно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСтавкаПервогоРазряда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСтавкиПервогоРазряда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсловияТрудаИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДеятельностиИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобыеУсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРаботника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезЕТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкладВВалюте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДляПечати</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсключитьИзПУ2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ауМестоРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СЭ_МестаРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременныйПереводКлимовичи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРаботникаУдалить</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьСотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ГрафикиРаботыПоВидамВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ГрафикиРаботыПоВидамВремени</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОсновноеЗначение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительноеЗначение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроизводственныйКалендарьПятидневка</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроизводственныйКалендарьПятидневкаЧасы</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроизводственныйКалендарьШестидневка</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроизводственныйКалендарьКалендарныеДни</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновноеЗначениеНорма</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительноеЗначениеНорма</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновноеЗначениеПолное</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительноеЗначениеПолное</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновноеЗначениеНормаПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительноеЗначениеНормаПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроизводственныйКалендарьПятидневкаПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроизводственныйКалендарьПятидневкаЧасыПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроизводственныйКалендарьШестидневкаПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроизводственныйКалендарьКалендарныеДниПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТабельУчетаРабочегоВремениОрганизации</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводИндивидуальныхГрафиковРаботыОрганизации</v8:Type>
						<v8:Type>cfg:DocumentRef.СдельныйНаряд</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>План</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчетаВремени</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетаВремени</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидВремени</Name>
					<Comment>Вид времени</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторИспользованияРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Reports/ГрафикиРаботы/Ext/ObjectModule.bsl
Перем мДлинаСуток Экспорт;

Процедура ГрафикРаботыВывести(Таб,ДатаНач,ДатаКон,Организация,ПодразделениеОрганизации) Экспорт
	
	Таб.Очистить();
	Макет = ПолучитьМакет("ГрафикРаботы");
	//Таб = ЭлементыФормы.ПолеТабличногоДокумента;
	
	
	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Период = "" + ПредставлениеПериода(ДатаНач, КонецДня(ДатаКон), "ДФ=""ММММ.гггг""");
	Область.Параметры.Организация = Организация.Наименование;
	Область.Параметры.ПодразделениеОрганизации = ПодразделениеОрганизации;
	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Организация, ТекущаяДата(),);
	Область.Параметры.Директор = Руководители.Руководитель;
	Таб.Вывести(Область);
	
	ОбластьШапкаОсновная = Макет.ПолучитьОбласть("ШапкаТаблицы|Основная");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаДата = Макет.ПолучитьОбласть("ШапкаТаблицы|Дата");
	ОбластьШапкаИтог = Макет.ПолучитьОбласть("ШапкаТаблицы|Итог");
	ОбластьДеталиОсновная = Макет.ПолучитьОбласть("Детали|Основная");
	ОбластьДеталиДата = Макет.ПолучитьОбласть("Детали|Дата");
	ОбластьДеталиИтог = Макет.ПолучитьОбласть("Детали|Итог");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	Таб.Вывести(ОбластьШапкаОсновная);
	
	НачДата = ДатаНач;
	ДД = Новый Массив(8);
	ДД[1] = "Пн.";
	ДД[2] = "Вт.";
	ДД[3] = "Ср.";
	ДД[4] = "Чт.";
	ДД[5] = "Пт.";
	ДД[6] = "Сб.";
	ДД[7] = "Вс.";
	Пока НачДата <= ДатаКон Цикл
		ОбластьШапкаДата.Параметры.Дата = Формат(НачДата, "ДФ=""дд.ММ""");
		ОбластьШапкаДата.Параметры.День = ДД[ДеньНедели(НачДата)];
		Таб.Присоединить(ОбластьШапкаДата);
		НачДата = КонецДня(НачДата) + 1;
	КонецЦикла;
	Таб.Присоединить(Макет.ПолучитьОбласть("ШапкаТаблицы|Итог"));
	
	ДД[1] = Перечисления.ДниНедели.Понедельник;
	ДД[2] = Перечисления.ДниНедели.Вторник;
	ДД[3] = Перечисления.ДниНедели.Среда;
	ДД[4] = Перечисления.ДниНедели.Четверг;
	ДД[5] = Перечисления.ДниНедели.Пятница;
	ДД[6] = Перечисления.ДниНедели.Суббота;
	ДД[7] = Перечисления.ДниНедели.Воскресенье;
	
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеГрафика.Сотрудник КАК Сотрудник,
	|	ДанныеГрафика.Дата КАК Дата,
	|	ДанныеГрафика.Организация КАК Организация,
	|	ДанныеГрафика.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	ДанныеГрафика.Должность КАК Должность,
	|	ДанныеГрафика.ГрафикРаботы КАК ГрафикРаботы,
	|	ДанныеГрафика.Период КАК Период,
	|	ДанныеГрафика.Дни КАК Дни,
	|	ДанныеГрафика.Часы КАК Часы,
	|	ДанныеГрафика.НочныеЧасы КАК НочныеЧасы,
	|	РегламентированныйПроизводственныйКалендарь.ВидДня
	|ИЗ
	|	(ВЫБРАТЬ
	|		РаботникиОрганизаций.Сотрудник КАК Сотрудник,
	|		ГрафикиРаботыПоВидамВремени.Дата КАК Дата,
	|		РаботникиОрганизаций.Организация КАК Организация,
	|		РаботникиОрганизаций.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|		РаботникиОрганизаций.Должность КАК Должность,
	|		РаботникиОрганизаций.ГрафикРаботы КАК ГрафикРаботы,
	|		РаботникиОрганизаций.Период КАК Период,
	|		СУММА(ВЫБОР
	|				КОГДА ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
	|					ТОГДА ВЫБОР
	|							КОГДА РаботникиОрганизаций.Период > ГрафикиРаботыПоВидамВремени.Дата
	|									И РаботникиОрганизаций.ПричинаИзмененияСостояния = &Прием
	|								ТОГДА 0
	|							КОГДА РаботникиОрганизаций.Период > ГрафикиРаботыПоВидамВремени.Дата
	|									И РаботникиОрганизаций.ПричинаИзмененияСостояния = &Перемещение
	|								ТОГДА 0
	|							ИНАЧЕ ГрафикиРаботыПоВидамВремени.ОсновноеЗначение
	|						КОНЕЦ
	|			КОНЕЦ) КАК Дни,
	|		СУММА(ВЫБОР
	|				КОГДА ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоЧасам)
	|					ТОГДА ВЫБОР
	|							КОГДА РаботникиОрганизаций.Период > ГрафикиРаботыПоВидамВремени.Дата
	|									И РаботникиОрганизаций.ПричинаИзмененияСостояния = &Прием
	|								ТОГДА 0
	|							КОГДА РаботникиОрганизаций.Период > ГрафикиРаботыПоВидамВремени.Дата
	|									И РаботникиОрганизаций.ПричинаИзмененияСостояния = &Перемещение
	|								ТОГДА 0
	|							ИНАЧЕ ГрафикиРаботыПоВидамВремени.ОсновноеЗначение
	|						КОНЕЦ
	|			КОНЕЦ) КАК Часы,
	|		СУММА(ВЫБОР
	|				КОГДА ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоНочнымЧасам)
	|					ТОГДА ВЫБОР
	|							КОГДА РаботникиОрганизаций.Период > ГрафикиРаботыПоВидамВремени.Дата
	|									И РаботникиОрганизаций.ПричинаИзмененияСостояния = &Прием
	|								ТОГДА 0
	|							КОГДА РаботникиОрганизаций.Период > ГрафикиРаботыПоВидамВремени.Дата
	|									И РаботникиОрганизаций.ПричинаИзмененияСостояния = &Перемещение
	|								ТОГДА 0
	|							ИНАЧЕ ГрафикиРаботыПоВидамВремени.ОсновноеЗначение
	|						КОНЕЦ
	|			КОНЕЦ) КАК НочныеЧасы
	|	ИЗ
	|		РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|				&ДатаНач,
	|				Организация = &Организация
	
	//Аверсон ЕАЕ 06.10.2025 СВФР-016898
	//|					И ПодразделениеОрганизации = &ПодразделениеОрганизации) КАК РаботникиОрганизаций
	|					) КАК РаботникиОрганизаций
	//Аверсон СВФР-016898
	
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|			ПО РаботникиОрганизаций.ГрафикРаботы = ГрафикиРаботыПоВидамВремени.ГрафикРаботы
	|	ГДЕ
	|		РаботникиОрганизаций.Сотрудник.ВидЗанятости В(&ВидЗанятости)
	|		И ГрафикиРаботыПоВидамВремени.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|		И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени В(&ВидыУчетаВремени)
	
	//Аверсон ЕАЕ 02.10.2025 СВФР-016898
	|	    И РаботникиОрганизаций.ПричинаИзмененияСостояния <> &ПричинаИзмененияСостояния
	|       И РаботникиОрганизаций.ПодразделениеОрганизации = &ПодразделениеОрганизации
	//Аверсон СВФР-016898
	
	|	СГРУППИРОВАТЬ ПО
	|		ГрафикиРаботыПоВидамВремени.Дата,
	|		РаботникиОрганизаций.Организация,
	|		РаботникиОрганизаций.ПодразделениеОрганизации,
	|		РаботникиОрганизаций.Должность,
	|		РаботникиОрганизаций.ГрафикРаботы,
	|		РаботникиОрганизаций.Период,
	|		РаботникиОрганизаций.Сотрудник
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РаботникиОрганизаций.Сотрудник,
	|		ГрафикиРаботыПоВидамВремени.Дата,
	|		РаботникиОрганизаций.Организация,
	|		РаботникиОрганизаций.ПодразделениеОрганизации,
	|		РаботникиОрганизаций.Должность,
	|		РаботникиОрганизаций.ГрафикРаботы,
	|		РаботникиОрганизаций.Период,
	|		СУММА(ВЫБОР
	|				КОГДА ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
	|					ТОГДА ВЫБОР
	|							КОГДА РаботникиОрганизаций.Период > ГрафикиРаботыПоВидамВремени.Дата
	|									И РаботникиОрганизаций.ПричинаИзмененияСостояния = &Прием
	|								ТОГДА 0
	|							КОГДА РаботникиОрганизаций.Период > ГрафикиРаботыПоВидамВремени.Дата
	|									И РаботникиОрганизаций.ПричинаИзмененияСостояния = &Перемещение
	|								ТОГДА 0
	|							ИНАЧЕ ГрафикиРаботыПоВидамВремени.ОсновноеЗначение
	|						КОНЕЦ
	|			КОНЕЦ),
	|		СУММА(ВЫБОР
	|				КОГДА ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоЧасам)
	|					ТОГДА ВЫБОР
	|							КОГДА РаботникиОрганизаций.Период > ГрафикиРаботыПоВидамВремени.Дата
	|									И РаботникиОрганизаций.ПричинаИзмененияСостояния = &Прием
	|								ТОГДА 0
	|							КОГДА РаботникиОрганизаций.Период > ГрафикиРаботыПоВидамВремени.Дата
	|									И РаботникиОрганизаций.ПричинаИзмененияСостояния = &Перемещение
	|								ТОГДА 0
	|							ИНАЧЕ ГрафикиРаботыПоВидамВремени.ОсновноеЗначение
	|						КОНЕЦ
	|			КОНЕЦ),
	|		СУММА(ВЫБОР
	|				КОГДА ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоНочнымЧасам)
	|					ТОГДА ВЫБОР
	|							КОГДА РаботникиОрганизаций.Период > ГрафикиРаботыПоВидамВремени.Дата
	|									И РаботникиОрганизаций.ПричинаИзмененияСостояния = &Прием
	|								ТОГДА 0
	|							КОГДА РаботникиОрганизаций.Период > ГрафикиРаботыПоВидамВремени.Дата
	|									И РаботникиОрганизаций.ПричинаИзмененияСостояния = &Перемещение
	|								ТОГДА 0
	|							ИНАЧЕ ГрафикиРаботыПоВидамВремени.ОсновноеЗначение
	|						КОНЕЦ
	|			КОНЕЦ)
	|	ИЗ
	|		РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|			ПО РаботникиОрганизаций.ГрафикРаботы = ГрафикиРаботыПоВидамВремени.ГрафикРаботы
	|	ГДЕ
	|		РаботникиОрганизаций.Период МЕЖДУ &ДатаНач И &ДатаКон
	|		И РаботникиОрганизаций.Организация = &Организация
	|		И РаботникиОрганизаций.ПодразделениеОрганизации = &ПодразделениеОрганизации
	|		И РаботникиОрганизаций.Сотрудник.ВидЗанятости В(&ВидЗанятости)
	|		И ГрафикиРаботыПоВидамВремени.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|		И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени В(&ВидыУчетаВремени)
	
	//Аверсон ЕАЕ 02.10.2025 СВФР-016898
	|И РаботникиОрганизаций.ПричинаИзмененияСостояния <> &ПричинаИзмененияСостояния
	//Аверсон СВФР-016898
	
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ГрафикиРаботыПоВидамВремени.Дата,
	|		РаботникиОрганизаций.Организация,
	|		РаботникиОрганизаций.ПодразделениеОрганизации,
	|		РаботникиОрганизаций.Должность,
	|		РаботникиОрганизаций.ГрафикРаботы,
	|		РаботникиОрганизаций.Период,
	|		РаботникиОрганизаций.Сотрудник) КАК ДанныеГрафика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|		ПО ДанныеГрафика.Дата = РегламентированныйПроизводственныйКалендарь.ДатаКалендаря
	|
	|СГРУППИРОВАТЬ ПО //О.Т. № 1269 (дублировалось)
	|	ДанныеГрафика.Сотрудник,
	|	ДанныеГрафика.Дата,
	|	ДанныеГрафика.Организация,
	|	ДанныеГрафика.ПодразделениеОрганизации,
	|	ДанныеГрафика.Должность,
	|	ДанныеГрафика.ГрафикРаботы,
	|	ДанныеГрафика.Период,
	|	РегламентированныйПроизводственныйКалендарь.ВидДня,
	|	ДанныеГрафика.Дни,
	|	ДанныеГрафика.Часы,
	|	ДанныеГрафика.НочныеЧасы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	Дата
	|ИТОГИ
	|	СУММА(Дни),
	|	СУММА(Часы),
	|	СУММА(НочныеЧасы)
	|ПО
	|	Сотрудник,
	|	Должность,
	|	ГрафикРаботы";
	
	//	|		И РаботникиОрганизаций.ПричинаИзмененияСостояния <> &ПричинаИзмененияСостояния
	ВидыЗанятости = Новый Массив;
	ВидыЗанятости.Добавить(Перечисления.ВидыЗанятостиВОрганизации.Совместительство);
	ВидыЗанятости.Добавить(Перечисления.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы);
	
	ВидыУчетаВремени = Новый Массив;
	ВидыУчетаВремени.Добавить(Перечисления.ВидыУчетаВремени.ПоЧасам);
	ВидыУчетаВремени.Добавить(Перечисления.ВидыУчетаВремени.ПоНочнымЧасам);
	ВидыУчетаВремени.Добавить(Перечисления.ВидыУчетаВремени.ПоДням);
	
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПодразделениеОрганизации", ПодразделениеОрганизации);
	Запрос.УстановитьПараметр("ПричинаИзмененияСостояния", Перечисления.ПричиныИзмененияСостояния.Увольнение);
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ДатаНач));
	Запрос.УстановитьПараметр("ДатаКон", НачалоМинуты(КонецДня(ДатаКон)));
	Запрос.УстановитьПараметр("ВидУчетаВремени", Перечисления.ВидыУчетаВремени.ПоЧасам);
	Запрос.УстановитьПараметр("ВидГрафика", Перечисления.ВидыРабочихГрафиков.Сменный);
	Запрос.УстановитьПараметр("Перемещение", Перечисления.ПричиныИзмененияСостояния.Перемещение);
	Запрос.УстановитьПараметр("Прием", Перечисления.ПричиныИзмененияСостояния.ПриемНаРаботу);
	Запрос.УстановитьПараметр("ВидЗанятости", ВидыЗанятости);
	Запрос.УстановитьПараметр("ВидыУчетаВремени", ВидыУчетаВремени);
	
	ПустаяДата = '00010101';
	
	//Аверсон ЕАЕ 02.10.2025 СВФР-016898
	//Периоды работы
	СписокСотрудников = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	ЗапросПериоды = Новый Запрос;
	ЗапросПериоды.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РаботникиОрганизацийСрез.Сотрудник,
	|	&Нач КАК Период,
	|	РаботникиОрганизацийСрез.Должность,
	|	РаботникиОрганизацийСрез.ПодразделениеОрганизации,
	|   РаботникиОрганизацийСрез.ГрафикРаботы
	|ПОМЕСТИТЬ ВТРаботникиОрганизаций
	|ИЗ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Нач, Сотрудник В (&СписокСотрудников)) КАК РаботникиОрганизацийСрез
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	РаботникиОрганизаций.Сотрудник,
	|	РаботникиОрганизаций.Период,
	|	РаботникиОрганизаций.Должность,
	|	РаботникиОрганизаций.ПодразделениеОрганизации,
	|   РаботникиОрганизаций.ГрафикРаботы
	|ИЗ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|ГДЕ РаботникиОрганизаций.Сотрудник В (&СписокСотрудников)
	|И РаботникиОрганизаций.Период МЕЖДУ &Нач И &Кон
	|;
	|////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТРаботникиОрганизаций.Сотрудник,
	|	ВТРаботникиОрганизаций.Сотрудник.ФизЛицо КАК ФизЛицо,
	|	ВТРаботникиОрганизаций.Сотрудник.Код КАК ТабНом,
	|	ВТРаботникиОрганизаций.Должность,
	|	ВТРаботникиОрганизаций.ПодразделениеОрганизации,
	|   ВТРаботникиОрганизаций.ГрафикРаботы,
	|   ВТРаботникиОрганизаций.Период КАК ДатаНач,
	|   МИНИМУМ(ЕСТЬNULL(ДОБАВИТЬКДАТЕ(РаботникиОрганизацийБольше.Период,СЕКУНДА,-1),&Кон)) КАК ДатаКон
	|ИЗ ВТРаботникиОрганизаций
	|ЛЕВОЕ СОЕДИНЕНИЕ ВТРаботникиОрганизаций КАК РаботникиОрганизацийБольше
	|ПО ВТРаботникиОрганизаций.Сотрудник = РаботникиОрганизацийБольше.Сотрудник
	|	И ВТРаботникиОрганизаций.Период < РаботникиОрганизацийБольше.Период
	|ГДЕ ВТРаботникиОрганизаций.ПодразделениеОрганизации = &Подразделение
	|СГРУППИРОВАТЬ ПО
	|	ВТРаботникиОрганизаций.Сотрудник,
	|	ВТРаботникиОрганизаций.Сотрудник.ФизЛицо,
	|	ВТРаботникиОрганизаций.Сотрудник.Код,
	|	ВТРаботникиОрганизаций.Должность,
	|	ВТРаботникиОрганизаций.ПодразделениеОрганизации,
	|   ВТРаботникиОрганизаций.ГрафикРаботы,
	|	ВТРаботникиОрганизаций.Период
	|УПОРЯДОЧИТЬ ПО
	|ВТРаботникиОрганизаций.Сотрудник.Наименование,
	|ДатаНач
	|";
	ЗапросПериоды.УстановитьПараметр("СписокСотрудников", СписокСотрудников);
	ЗапросПериоды.УстановитьПараметр("Нач", НачалоДня(ДатаНач));
	ЗапросПериоды.УстановитьПараметр("Кон", НачалоМинуты(КонецДня(ДатаКон)));
	ЗапросПериоды.УстановитьПараметр("Подразделение", ПодразделениеОрганизации);
	
	ТЗПериоды = ЗапросПериоды.Выполнить().Выгрузить();
	
	//Аверсон СВФР-016898
	
	ВыборкаПоСотруднику = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоСотруднику.Следующий() цикл
		ВыборкаПоДолжностям = ВыборкаПоСотруднику.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоДолжностям.Следующий() цикл
			
			//Аверсон ЕАЕ 02.10.2025 СВФР-016898
			СтрокаДни = 0;
			СтрокаЧасы = 0;
			СтрокаНочныеЧасы = 0;
			//Аверсон СВФР-016898
			
			ВыборкаПоГрафикам = ВыборкаПоДолжностям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоГрафикам.Следующий() цикл
				ОбластьДеталиОсновная.Параметры.ФизЛицо = ВыборкаПоГрафикам.Сотрудник;
				ОбластьДеталиОсновная.Параметры.Должность = ВыборкаПоГрафикам.Должность;
				Таб.Вывести(ОбластьДеталиОсновная);
				
				//Аверсон ЕАЕ 02.10.2025 СВФР-016898
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("Сотрудник", ВыборкаПоГрафикам.Сотрудник);
				СтруктураОтбора.Вставить("Должность", ВыборкаПоГрафикам.Должность);
				СтруктураОтбора.Вставить("ГрафикРаботы", ВыборкаПоГрафикам.ГрафикРаботы);
				НужныеСтроки = ТЗПериоды.НайтиСтроки(СтруктураОтбора);
				//Аверсон СВФР-016898
				
				Если ВыборкаПоГрафикам.ГрафикРаботы.ВидГрафика = Перечисления.ВидыРабочихГрафиков.Пятидневка 
					ИЛИ ВыборкаПоГрафикам.ГрафикРаботы.ВидГрафика = Перечисления.ВидыРабочихГрафиков.Шестидневка тогда
					ВыборкаПоДням = ВыборкаПоГрафикам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаПоДням.Следующий() Цикл
						ОбластьДеталиДата = Макет.ПолучитьОбласть("Детали|Дата");
						Если ВыборкаПоДням.Дни > 0 тогда
							
							//Аверсон ЕАЕ 02.10.2025 СВФР-016898
							Работал = Ложь;
							Если НужныеСтроки.Количество() > 0 Тогда
								Для Каждого Пер Из НужныеСтроки Цикл
									Если ВыборкаПоДням.Дата >= Пер.ДатаНач И ВыборкаПоДням.Дата <= Пер.ДатаКон Тогда
										Работал = Истина;
										Прервать;
									КонецЕсли;
								КонецЦикла;
							КонецЕсли;
							Если НЕ Работал Тогда
								Таб.Присоединить(ОбластьДеталиДата);	
							Иначе
								//Аверсон СВФР-016898
								
								Отбор = Новый Структура;
								Отбор.Вставить("ДеньНедели", ДД[ДеньНедели(ВыборкаПоДням.Дата)]);
								ВремяРаботы = ВыборкаПоДням.ГрафикРаботы.ПериодыСмены.НайтиСтроки(Отбор);
								Если ВремяРаботы.Количество() = 1 тогда
									ВремяНачала = ВремяРаботы[0].ВремяНачала;
									ВремяОкончания = ВремяРаботы[0].ВремяОкончания;
									
									Если ВыборкаПоДням.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный тогда
										ВремяОкончания = ВремяОкончания - 60*60;
									КонецЕсли;
									
									//Аверсон ЕАЕ 02.10.2025 СВФР-016898
									//ОбластьДеталиДата.Параметры.ВремяРаботы1 = Формат(ВремяНачала,"ДФ=""ЧЧ:мм""")+"-"+ Формат(ВремяОкончания,"ДФ=""ЧЧ:мм""");
									ОбластьДеталиДата.Параметры.ВремяРаботы1 = ?(ЗначениеЗаполнено(ВремяНачала),Формат(ВремяНачала,"ДФ=""ЧЧ:мм"""), "00:00") + "-" + ?(ЗначениеЗаполнено(ВремяОкончания), Формат(ВремяОкончания,"ДФ=""ЧЧ:мм"""),"00:00");
									//Аверсон СВФР-016898
								КонецЕсли;
								
								Если ВремяРаботы.Количество() = 2 тогда
									ВремяНачала = ВремяРаботы[0].ВремяНачала;
									ВремяОкончания = ВремяРаботы[0].ВремяОкончания;
									ОбластьДеталиДата.Параметры.ВремяРаботы1 = Формат(ВремяНачала,"ДФ=""ЧЧ:мм""")+"-"+ Формат(ВремяОкончания,"ДФ=""ЧЧ:мм""");
									ВремяНачала = ВремяРаботы[1].ВремяНачала;
									ВремяОкончания = ВремяРаботы[1].ВремяОкончания;
									Если ВыборкаПоДням.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный тогда
										ВремяОкончания = ВремяОкончания - 60*60;
									КонецЕсли;
									
									//Аверсон ЕАЕ 02.10.2025 СВФР-016898
									//ОбластьДеталиДата.Параметры.ВремяРаботы2 = Формат(ВремяНачала,"ДФ=""ЧЧ:мм""")+"-"+ Формат(ВремяОкончания,"ДФ=""ЧЧ:мм""");
									ОбластьДеталиДата.Параметры.ВремяРаботы2 = ?(ЗначениеЗаполнено(ВремяНачала),Формат(ВремяНачала,"ДФ=""ЧЧ:мм"""),"00:00") + "-" + ?(ЗначениеЗаполнено(ВремяОкончания),Формат(ВремяОкончания,"ДФ=""ЧЧ:мм"""),"00:00");
									//Аверсон СВФР-016898
								КонецЕсли;
								
								ОбластьДеталиДата.Параметры.Часы = ВыборкаПоДням.Часы;
								
								//Аверсон ЕАЕ 02.10.2025 СВФР-016898
								СтрокаЧасы = СтрокаЧасы + ВыборкаПоДням.Часы;
								СтрокаДни = СтрокаДни + ВыборкаПоДням.Дни;
								СтрокаНочныеЧасы = СтрокаНочныеЧасы + ВыборкаПоДням.НочныеЧасы;
								//Аверсон СВФР-016898
								
								Таб.Присоединить(ОбластьДеталиДата);
							КонецЕсли;
						Иначе 
							Таб.Присоединить(ОбластьДеталиДата);
						КонецЕсли;
					КонецЦикла;
				ИначеЕсли ВыборкаПоГрафикам.ГрафикРаботы.ВидГрафика = Перечисления.ВидыРабочихГрафиков.Сменный тогда 
					ТаблицаСмен = ВыборкаПоГрафикам.ГрафикРаботы.Смены;
					ДатаОтсчета = ВыборкаПоГрафикам.ГрафикРаботы.ДатаОтсчета;
					КоличествоДней = ТаблицаСмен.Количество();
					ВыборкаПоДням = ВыборкаПоГрафикам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаПоДням.Следующий() Цикл
						ОбластьДеталиДата = Макет.ПолучитьОбласть("Детали|Дата");
						Если ВыборкаПоДням.Дни > 0 тогда 
							
							//Аверсон ЕАЕ 02.10.2025 СВФР-016898
							Работал = Ложь;
							Если НужныеСтроки.Количество() > 0 Тогда
								Для Каждого Пер Из НужныеСтроки Цикл
									Если ВыборкаПоДням.Дата >= Пер.ДатаНач И ВыборкаПоДням.Дата <= Пер.ДатаКон Тогда
										Работал = Истина;
										Прервать;
									КонецЕсли;
								КонецЦикла;
							КонецЕсли;
							
							Если Не Работал Тогда
								Таб.Присоединить(ОбластьДеталиДата);	
							Иначе
								//Аверсон СВФР-016898
								
								Если ВыборкаПоДням.Дата >= ДатаОтсчета Тогда //Аверсон ЕАЕ 04.11.2025 СВФР-016898
									НомерДня = ((ВыборкаПоДням.Дата - ДатаОтсчета)/мДлинаСуток)%КоличествоДней;
									Если ТаблицаСмен.Количество() >= НомерДня + 1 Тогда //Аверсон ЕАЕ 04.11.2025 СВФР-016898
										СтрокаТаблицыСмен = ТаблицаСмен[НомерДня];
										ТаблицаПериодовСмен = СтрокаТаблицыСмен.Смена.ПериодыСмены;
										Если ТаблицаПериодовСмен.Количество() = 1 тогда
											Если ТаблицаПериодовСмен[0].ВремяНачала = ПустаяДата тогда
												
												//Аверсон ЕАЕ 02.10.2025 СВФР-016898
												//ОбластьДеталиДата.Параметры.ВремяРаботы1 = "         -"+ Формат(ТаблицаПериодовСмен[0].ВремяОкончания,"ДФ=""ЧЧ:мм""");
												ОбластьДеталиДата.Параметры.ВремяРаботы1 = "00:00-"+ Формат(ТаблицаПериодовСмен[0].ВремяОкончания,"ДФ=""ЧЧ:мм""");
												//Аверсон СВФР-016898
												
											ИначеЕсли ТаблицаПериодовСмен[0].ВремяОкончания = КонецДня(ПустаяДата) тогда
												ОбластьДеталиДата.Параметры.ВремяРаботы1 = Формат(ТаблицаПериодовСмен[0].ВремяНачала,"ДФ=""ЧЧ:мм""")+"-";	
											Иначе
												
												//Аверсон ЕАЕ 02.10.2025 СВФР-016898
												//ОбластьДеталиДата.Параметры.ВремяРаботы1 = Формат(ТаблицаПериодовСмен[0].ВремяНачала,"ДФ=""ЧЧ:мм""")+"-"+ Формат(ТаблицаПериодовСмен[0].ВремяОкончания,"ДФ=""ЧЧ:мм""");
												ОбластьДеталиДата.Параметры.ВремяРаботы1 = Формат(ТаблицаПериодовСмен[0].ВремяНачала,"ДФ=""ЧЧ:мм""")+"-"+ ?(ЗначениеЗаполнено(ТаблицаПериодовСмен[0].ВремяОкончания),Формат(ТаблицаПериодовСмен[0].ВремяОкончания,"ДФ=""ЧЧ:мм"""),"00:00");
												//Аверсон СВФР-016898
												
											КонецЕсли;
										КонецЕсли;
										Если ТаблицаПериодовСмен.Количество() = 2 тогда 
											
											Если ТаблицаПериодовСмен[0].ВремяНачала = ПустаяДата тогда
												
												//Аверсон ЕАЕ 02.10.2025 СВФР-016898
												//ОбластьДеталиДата.Параметры.ВремяРаботы1 = "         -"+ Формат(ТаблицаПериодовСмен[0].ВремяОкончания,"ДФ=""ЧЧ:мм""");
												ОбластьДеталиДата.Параметры.ВремяРаботы1 = "00:00-"+ Формат(ТаблицаПериодовСмен[0].ВремяОкончания,"ДФ=""ЧЧ:мм""");
												//Аверсон СВФР-016898
												
											ИначеЕсли ТаблицаПериодовСмен[0].ВремяОкончания = КонецДня(ПустаяДата) тогда
												ОбластьДеталиДата.Параметры.ВремяРаботы1 = Формат(ТаблицаПериодовСмен[0].ВремяНачала,"ДФ=""ЧЧ:мм""")+"-";	
											Иначе
												
												//Аверсон ЕАЕ 02.10.2025 СВФР-016898
												//ОбластьДеталиДата.Параметры.ВремяРаботы1 = Формат(ТаблицаПериодовСмен[0].ВремяНачала,"ДФ=""ЧЧ:мм""")+"-"+ Формат(ТаблицаПериодовСмен[0].ВремяОкончания,"ДФ=""ЧЧ:мм""");
												ОбластьДеталиДата.Параметры.ВремяРаботы1 = Формат(ТаблицаПериодовСмен[0].ВремяНачала,"ДФ=""ЧЧ:мм""")+"-"+ ?(ЗначениеЗаполнено(ТаблицаПериодовСмен[0].ВремяОкончания),Формат(ТаблицаПериодовСмен[0].ВремяОкончания,"ДФ=""ЧЧ:мм"""),"00:00");
												//Аверсон СВФР-016898
												
											КонецЕсли;
											Если ТаблицаПериодовСмен[1].ВремяНачала = ПустаяДата тогда 
												
												//Аверсон ЕАЕ 02.10.2025 СВФР-016898
												//ОбластьДеталиДата.Параметры.ВремяРаботы2 = "         -"+ Формат(ТаблицаПериодовСмен[1].ВремяОкончания,"ДФ=""ЧЧ:мм""");
												ОбластьДеталиДата.Параметры.ВремяРаботы2 = "00:00-"+ Формат(ТаблицаПериодовСмен[1].ВремяОкончания,"ДФ=""ЧЧ:мм""");
												//Аверсон СВФР-016898
												
											ИначеЕсли ТаблицаПериодовСмен[1].ВремяОкончания = КонецДня(ПустаяДата) тогда
												ОбластьДеталиДата.Параметры.ВремяРаботы2 = Формат(ТаблицаПериодовСмен[1].ВремяНачала,"ДФ=""ЧЧ:мм""")+"-";	
											Иначе
												//Аверсон ЕАЕ 02.10.2025 СВФР-016898
												//ОбластьДеталиДата.Параметры.ВремяРаботы2 = Формат(ТаблицаПериодовСмен[1].ВремяНачала,"ДФ=""ЧЧ:мм""")+"-"+ Формат(ТаблицаПериодовСмен[1].ВремяОкончания,"ДФ=""ЧЧ:мм""");
												ОбластьДеталиДата.Параметры.ВремяРаботы2 = Формат(ТаблицаПериодовСмен[1].ВремяНачала,"ДФ=""ЧЧ:мм""")+"-"+ ?(ЗначениеЗаполнено(ТаблицаПериодовСмен[1].ВремяОкончания),Формат(ТаблицаПериодовСмен[1].ВремяОкончания,"ДФ=""ЧЧ:мм"""),"00:00");
												//Аверсон СВФР-016898
											КонецЕсли;
											
										КонецЕсли;
									КонецЕсли;
								КонецЕсли;
								//Аверсон ЕАЕ 02.10.2025 СВФР-016898
								СтрокаЧасы = СтрокаЧасы + ВыборкаПоДням.Часы;
								СтрокаДни = СтрокаДни + ВыборкаПоДням.Дни;
								СтрокаНочныеЧасы = СтрокаНочныеЧасы + ВыборкаПоДням.НочныеЧасы;
								//Аверсон СВФР-016898
								
								Таб.Присоединить(ОбластьДеталиДата);
							КонецЕсли;
						Иначе 
							Таб.Присоединить(ОбластьДеталиДата);
						КонецЕсли;
						
					КонецЦикла;
				КонецЕсли;
				
				//Аверсон ЕАЕ 02.10.2025 СВФР-016898
				//ОбластьДеталиИтог.Параметры.РабочихДней = ВыборкаПоГрафикам.Дни;
				//ОбластьДеталиИтог.Параметры.РабочихЧасов = ВыборкаПоГрафикам.Часы;
				//ОбластьДеталиИтог.Параметры.РабочихНочных = ВыборкаПоГрафикам.НочныеЧасы;
				ОбластьДеталиИтог.Параметры.РабочихДней = СтрокаДни;
				ОбластьДеталиИтог.Параметры.РабочихЧасов = СтрокаЧасы;
				ОбластьДеталиИтог.Параметры.РабочихНочных = СтрокаНочныеЧасы;
				//Аверсон СВФР-016898
				
				Таб.Присоединить(ОбластьДеталиИтог);
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	
	Таб.Вывести(ОбластьПодвал);
КонецПроцедуры
#Если Клиент Тогда
	
	НастройкаПериода = Новый НастройкаПериода;
	
#КонецЕсли
мДлинаСуток = 86400;
